x = 1971 : 1 : 1985;
y = [8.5229, 8.7177, 8.9211, 9.0859, 9.2420, 9.3717, 9.4974, 9.6259, 9.7542, 9.8705, 10.0072, 10.1654, 10.3008, 10.4357, 10.5851];

xi = 1971 : 0.25 : 1990;
yi1 = interp1(x, y, xi, '*nearest');
yi2 = interp1(x, y, xi, '*linear');
yi3 = interp1(x, y, xi, '*spline');
yi4 = interp1(x, y, xi, '*PCHIP');

xo = [x, 1986 : 1 : 1990];
yo = [y, 10.7507, 10.9300, 11.1026, 11.2704, 11.4333];
plot(xo, yo, 'ro',xi, yi1, '--', xi, yi2, '-', xi, yi3, 'k.-', xi, yi4, 'm:');
legend('原始数据', '最近点插值', '线性插值', '样条插值', '立方插值');

